[
    {
        "title": "⚙️ NEO’25 – The Battle for Innovation Begins | 21–23 Nov",
        "upvotes": 3,
        "timestamp": "2025-10-18T11:04:47+00:00",
        "all_comments": [
            "Lets gooo"
        ]
    },
    {
        "title": "Transfer",
        "upvotes": 9,
        "timestamp": "2025-10-18T05:57:27+00:00",
        "all_comments": [
            "Following",
            "yes it is possible u just need a certain gpa and the courses should be credibe check giki website and compare ai credit hours of giki with fast if same subjects issue nhi hoga",
            "??",
            "I meant I’m following this thread, I want to switch too",
            "Which uni are u in currently?"
        ]
    },
    {
        "title": "Giki CS/AI/DS/SE/CE",
        "upvotes": 5,
        "timestamp": "2025-10-17T19:03:15+00:00",
        "all_comments": []
    },
    {
        "title": "UG ADMISSION FOR PRE-MEDICAL STUDENTS IN BCS IN GIKI!",
        "upvotes": 4,
        "timestamp": "2025-10-17T11:59:41+00:00",
        "all_comments": [
            "Walaikum asalam,\n\nNust kay liye koi restrictions nhi admission kay liye bss NET clear krna hota hai probably 150+ could get you inn easily. Fast ka bhi same hai fast entry test clear krna hota hai ya phir NTS laikin NTS ki seats kam hoti hain tou i would suggest going for fast's test. Giki different hai uskay liye inter main math honi hi chahiye warna wo mngt scns kay allawa koi alag department offer hi nhi krtay \n\nI reckon tumhara interest giki main hai tou try karo additional math ka ppr dedon 2026 board pprs main ( i did alevels so i dont really know about punjab board kay wo bio aur math dono kay ppr kay liye ek saath appear krnay detay hain ya nhi) \n\nYe universities annually ek hi intake leti hain august/ sep main classes bhi start ho jaati hain\n\nAur koi questions hon to feel free to dm."
        ]
    },
    {
        "title": "If your lonely dm me 🥀 (batch 35)",
        "upvotes": 1,
        "timestamp": "2025-10-16T16:30:04+00:00",
        "all_comments": [
            "Check dm"
        ]
    },
    {
        "title": "Bijli plz on kar do parhna hai",
        "upvotes": 3,
        "timestamp": "2025-10-16T15:36:55+00:00",
        "all_comments": [
            "Agai light 🐳"
        ]
    },
    {
        "title": "Colorfest ticket for sale",
        "upvotes": 2,
        "timestamp": "2025-10-16T08:15:31+00:00",
        "all_comments": []
    },
    {
        "title": "Anybody selling ticket of color fest",
        "upvotes": 1,
        "timestamp": "2025-10-16T05:13:46+00:00",
        "all_comments": []
    },
    {
        "title": "Is Maanu coming to GIKI?",
        "upvotes": 6,
        "timestamp": "2025-10-15T18:43:53+00:00",
        "all_comments": [
            "seems like a scarcity of artists at giki",
            "Last time Bilal saeed came on their event. But no idea who is coming this time. But the last concert went very well. My brother went and he really enjoyed  their. Hope so this year they invite someone good again.",
            " Yes you are right",
            "when’s the event happening??",
            "Evolve 2025"
        ]
    },
    {
        "title": "Ph 101 lab",
        "upvotes": 3,
        "timestamp": "2025-10-15T18:38:40+00:00",
        "all_comments": [
            "I Don’t remember the labs, but i know this misery. Been 11 years now when i was in those shoes. \nJust don’t panic.",
            "You'll be given any one of the experiments randomly ( from the ones you have done)",
            "Just watch hamza naeem’s videos pn youtube",
            "stop asking, start doing...\n\n![gif](giphy|qDPg6HNz2NfAk)",
            "Yar watch hamza naeems videos from yt and know just kai tweak the data to get error within 5% me and my partner never got the labs within acceptable error so we had to tweak the data in every lab and we knew where to change it so that we got the correct values"
        ]
    }
]